DOACNN(
  (conv1): Conv2d(3, 256, kernel_size=(3, 3), stride=(2, 2))
  (conv4): Conv2d(256, 256, kernel_size=(2, 2), stride=(1, 1))
  (conv7): Conv2d(256, 256, kernel_size=(2, 2), stride=(1, 1))
  (conv10): Conv2d(256, 256, kernel_size=(2, 2), stride=(1, 1))
  (norm2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (norm5): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (norm8): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (norm11): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (relu3): ReLU()
  (relu6): ReLU()
  (relu9): ReLU()
  (relu12): ReLU()
  (relu15): ReLU()
  (relu18): ReLU()
  (relu21): ReLU()
  (dropout16): Dropout(p=0.2, inplace=False)
  (dropout19): Dropout(p=0.2, inplace=False)
  (dropout22): Dropout(p=0.2, inplace=False)
  (flatten13): Flatten(start_dim=1, end_dim=-1)
  (fc14): Linear(in_features=256, out_features=4096, bias=True)
  (fc17): Linear(in_features=4096, out_features=2048, bias=True)
  (fc20): Linear(in_features=2048, out_features=1024, bias=True)
  (fc23): Linear(in_features=1024, out_features=91, bias=True)
  (sigmoid): Sigmoid()
)